INSERT INTO rivers (name)
VALUES ('Волхов');

INSERT INTO river_segments 
(river_id, segment_order, name, length_km, self_cleaning_rate)
VALUES
(1, 1, 'Участок 1', 2.0, 0.05),
(1, 2, 'Участок 2', 2.0, 0.06),
(1, 3, 'Участок 3', 1.5, 0.08),
(1, 4, 'Участок 4', 2.2, 0.07),
(1, 5, 'Участок 5', 1.8, 0.06);

INSERT INTO sensors (segment_id, name, is_active)
VALUES
(1, 'Датчик 1', TRUE),
(2, 'Датчик 2', TRUE),
(3, 'Датчик 3', TRUE),
(4, 'Датчик 4', TRUE),
(5, 'Датчик 5', TRUE);

INSERT INTO pollutants (name, danger_threshold, decay_multiplier)
VALUES
('Нефтепродукты', 75, 0.85),
('Химические отходы', 60, 0.95),
('Органические отходы', 90, 0.70);

INSERT INTO flow_conditions (segment_id, measured_at, direction, speed_kmh)
VALUES
(1, '2025-05-23 10:00:00', 1, 1.0),
(2, '2025-05-23 10:00:00', 1, 1.1),
(3, '2025-05-23 10:00:00', 1, 1.3),
(4, '2025-05-23 10:00:00', 1, 1.0),
(5, '2025-05-23 10:00:00', 1, 0.8),

(1, '2025-05-23 11:00:00', 1, 1.0),
(2, '2025-05-23 11:00:00', 1, 1.2),
(3, '2025-05-23 11:00:00', 1, 1.4),
(4, '2025-05-23 11:00:00', 1, 1.1),
(5, '2025-05-23 11:00:00', 1, 0.9),

(1, '2025-05-23 12:00:00', 1, 0.9),
(2, '2025-05-23 12:00:00', 1, 1.0),
(3, '2025-05-23 12:00:00', 1, 1.2),
(4, '2025-05-23 12:00:00', 1, 1.0),
(5, '2025-05-23 12:00:00', 1, 0.8),

(1, '2025-05-23 13:00:00', -1, 0.7),
(2, '2025-05-23 13:00:00', -1, 0.8),
(3, '2025-05-23 13:00:00', -1, 0.9),
(4, '2025-05-23 13:00:00', -1, 0.8),
(5, '2025-05-23 13:00:00', -1, 0.7);

INSERT INTO measurements (sensor_id, measured_at, concentration)
VALUES
(1, '2025-05-23 10:00:00', 5),
(2, '2025-05-23 10:00:00', 8),
(3, '2025-05-23 10:00:00', 90),
(4, '2025-05-23 10:00:00', 72),
(5, '2025-05-23 10:00:00', 57);